<a href="https://colab.research.google.com/github/bachi-mohamed-rafik/pandas/blob/main/Fictional_Army.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Fictional Army

In [1]:
import pandas as pd
# Create an example dataframe about a fictional army
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}


army=pd.DataFrame(raw_data, columns = ['regiment','company','deaths','battles','size','veterans','readiness','armored','deserters','origin'])

army.set_index('origin')
print(army)

      regiment company  deaths  ...  armored  deserters      origin
0   Nighthawks     1st     523  ...        1          4     Arizona
1   Nighthawks     1st      52  ...        0         24  California
2   Nighthawks     2nd      25  ...        1         31       Texas
3   Nighthawks     2nd     616  ...        1          2     Florida
4     Dragoons     1st      43  ...        0          3       Maine
5     Dragoons     1st     234  ...        1          4        Iowa
6     Dragoons     2nd     523  ...        0         24      Alaska
7     Dragoons     2nd      62  ...        1         31  Washington
8       Scouts     1st      62  ...        0          2      Oregon
9       Scouts     1st      73  ...        0          3     Wyoming
10      Scouts     2nd      37  ...        1          2    Louisana
11      Scouts     2nd      35  ...        1          3     Georgia

[12 rows x 10 columns]

In [2]:
# Print only the column veterans
print("Print only the column veterans:")
column_veterans=army['veterans']
print(column_veterans)

# Print the columns 'veterans' and 'deaths'
print("Print the columns 'veterans' and 'deaths' :")
h=army[['veterans' , 'deaths']]
print(h)

Print only the column veterans:
0       1
1       5
2      62
3      26
4      73
5      37
6     949
7      48
8      48
9     435
10     63
11    345
Name: veterans, dtype: int64
Print the columns 'veterans' and 'deaths' :
    veterans  deaths
0          1     523
1          5      52
2         62      25
3         26     616
4         73      43
5         37     234
6        949     523
7         48      62
8         48      62
9        435      73
10        63      37
11       345      35

In [3]:
# Print the name of all the columns
print("Print the name of all the columns:")
print( army.columns)

# Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska
print("Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska:")
s=army.loc[army.origin.isin(['Maine ',' Alaska']),['deaths', 'size' , 'deserters']]
print(s)

Print the name of all the columns:
Index(['regiment', 'company', 'deaths', 'battles', 'size', 'veterans',
       'readiness', 'armored', 'deserters', 'origin'],
      dtype='object')
Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska:
Empty DataFrame
Columns: [deaths, size, deserters]
Index: []

In [4]:
# Select the rows 3 to 7 and the columns 3 to 6
print("Select the rows 3 to 7 and the columns 3 to 6:")
print(army.iloc[3:8,3:7])

# Select every row after the fourth row and all columns
print("Select every row after the fourth row and all columns :")
print(army.iloc[4:,:])

Select the rows 3 to 7 and the columns 3 to 6:
   battles  size  veterans  readiness
3        2  1400        26          3
4        4  1592        73          2
5        7  1006        37          1
6        8   987       949          2
7        3   849        48          3
Select every row after the fourth row and all columns :
    regiment company  deaths  ...  armored  deserters      origin
4   Dragoons     1st      43  ...        0          3       Maine
5   Dragoons     1st     234  ...        1          4        Iowa
6   Dragoons     2nd     523  ...        0         24      Alaska
7   Dragoons     2nd      62  ...        1         31  Washington
8     Scouts     1st      62  ...        0          2      Oregon
9     Scouts     1st      73  ...        0          3     Wyoming
10    Scouts     2nd      37  ...        1          2    Louisana
11    Scouts     2nd      35  ...        1          3     Georgia

[8 rows x 10 columns]

In [6]:
# Select every row up to the 4th row and all columns
print("Select every row up to the 4th row and all columns:")
print(army.iloc[:4,:])

# Select the 3rd column up to the 7th column
print("Select the 3rd column up to the 7th column :")
print(army.columns[2:7])

Select every row up to the 4th row and all columns:
     regiment company  deaths  ...  armored  deserters      origin
0  Nighthawks     1st     523  ...        1          4     Arizona
1  Nighthawks     1st      52  ...        0         24  California
2  Nighthawks     2nd      25  ...        1         31       Texas
3  Nighthawks     2nd     616  ...        1          2     Florida

[4 rows x 10 columns]
Select the 3rd column up to the 7th column :
Index(['deaths', 'battles', 'size', 'veterans', 'readiness'], dtype='object')

In [7]:
# Select rows where df.deaths is greater than 50
print("Select rows where df.deaths is greater than 50:")
va=army[(army.deaths>50)]
print(va)

# Select rows where df.deaths is greater than 500 or less than 50
print("Select rows where df.deaths is greater than 500 or less than 50 :")
x=army[(army.deaths<50 )| (army.deaths >500)]
print(x)

Select rows where df.deaths is greater than 50:
     regiment company  deaths  ...  armored  deserters      origin
0  Nighthawks     1st     523  ...        1          4     Arizona
1  Nighthawks     1st      52  ...        0         24  California
3  Nighthawks     2nd     616  ...        1          2     Florida
5    Dragoons     1st     234  ...        1          4        Iowa
6    Dragoons     2nd     523  ...        0         24      Alaska
7    Dragoons     2nd      62  ...        1         31  Washington
8      Scouts     1st      62  ...        0          2      Oregon
9      Scouts     1st      73  ...        0          3     Wyoming

[8 rows x 10 columns]
Select rows where df.deaths is greater than 500 or less than 50 :
      regiment company  deaths  ...  armored  deserters    origin
0   Nighthawks     1st     523  ...        1          4   Arizona
2   Nighthawks     2nd      25  ...        1         31     Texas
3   Nighthawks     2nd     616  ...        1          2   Florida
4     Dragoons     1st      43  ...        0          3     Maine
6     Dragoons     2nd     523  ...        0         24    Alaska
10      Scouts     2nd      37  ...        1          2  Louisana
11      Scouts     2nd      35  ...        1          3   Georgia

[7 rows x 10 columns]

In [8]:
# Select all the regiments not named "Dragoons"
print("Select all the regiments not named Dragoons:")

b=army[army['regiment']!='Dragoons']
print(b)

# Select the rows called Texas and Arizona
print("Select the rows called Texas and Arizona :")
rta=army[(army.origin == "Texas")|(army.origin == "Arizona")]
print(rta)

Select all the regiments not named Dragoons:
      regiment company  deaths  ...  armored  deserters      origin
0   Nighthawks     1st     523  ...        1          4     Arizona
1   Nighthawks     1st      52  ...        0         24  California
2   Nighthawks     2nd      25  ...        1         31       Texas
3   Nighthawks     2nd     616  ...        1          2     Florida
8       Scouts     1st      62  ...        0          2      Oregon
9       Scouts     1st      73  ...        0          3     Wyoming
10      Scouts     2nd      37  ...        1          2    Louisana
11      Scouts     2nd      35  ...        1          3     Georgia

[8 rows x 10 columns]
Select the rows called Texas and Arizona :
     regiment company  deaths  battles  ...  readiness  armored  deserters   origin
0  Nighthawks     1st     523        5  ...          1        1          4  Arizona
2  Nighthawks     2nd      25        2  ...          3        1         31    Texas

[2 rows x 10 columns]

In [9]:
# Select the third cell in the row named Arizona
print("Select the third cell in the row named Arizona :")
ra=army[(army.origin == "Arizona")]
print(ra.deaths)

# Select the third cell down in the column named deaths
print("Select the third cell down in the column named deaths :")
tcd=army.deaths
print( tcd[3])

Select the third cell in the row named Arizona :
0    523
Name: deaths, dtype: int64
Select the third cell down in the column named deaths :
616